--- a/00_backup/qiita/68_異なるScalaバージョンのアプリがあるプロジェクトにおけるsbtのクロスビルドについて/README.md
+++ b/00_backup/qiita/68_異なるScalaバージョンのアプリがあるプロジェクトにおけるsbtのクロスビルドについて/README.md
@@ -8,26 +8,29 @@ sbtは、異なるScalaバージョンであってもクロスビルドの設定
 
 appは規模がでかいので、一気にapp2にはせずに、少しずつ機能を移していこうと思います。切り出す機能はドメインオブジェクトを使っていたので、appとapp2の両方で使えるように、共通コード置き場を用意しました。ここに、ドメインオブジェクトがどんどん増えていく予定です。
 
-```plantuml
-artifact "app@2.11\n(root)" as p1
-artifact "app2@3.3" as p2
-artifact "domain@2.11\ndomain@3.3" as d
+```mermaid
+flowchart LR
+  p1["app@2.11<br/>(root)"]
+  p2["app2@3.3"]
+  d["domain@2.11<br/>domain@3.3"]
 
-d <-- p1
-d <-- p2
+  p1 --> d
+  p2 --> d
 ```
 
 # 設定ファイル
